controllers/SiteController.php

INSERT INTO `author` (`first_name`, `last_name`, `middle_name`) VALUES ('Stephen ', 'King', '')
---
    public function actionCreateAuthor()
    {
        $data = Yii::$app->request->post();
        $model = new Author();
        $model->load($data);
        if(!$model->save()){

SELECT * FROM `author` WHERE `id`='1'
---
    public function actionEditAuthor($id)
    {
        $model = Author::find()->where(['id' => $id])->one();

SELECT * FROM `author` WHERE `id`='2'
DELETE FROM `author` WHERE `id`=2
---
    public function actionDeleteAuthor($id)
    {
        $model = Author::find()->where(['id' => $id])->one();
        !empty($model) ? $model->delete() : var_dump('Error delete author id='. $id .'!');

INSERT INTO `book` (`book_title`, `short_description`, `picture_path`, `authors_id`, `publication_date`) VALUES ('Harry Potter and the Goblet of Fire', '=', '/upload/6024996dca642680886297.jpg', '12', '2021-02-01')
---
    public function actionCreateBook()
    {
        $data = Yii::$app->request->post('Book');
        $model = new Book();
        $formated_data =[
            'book_title' => $data['book_title'],
            'short_description' => $data['short_description'],
            'picture_path' => $data['imageFile'],
            'authors_id' => implode(',',$data['authors_id']),
            'publication_date' => $data['publication_date'],
        ];

        $model->load(['Book' =>$formated_data]);
        if(!$model->save()){

SELECT * FROM `book` WHERE `id`='9'
UPDATE `book` SET `book_title`='Harry Зotter and the philosopher\'s stone' WHERE `id`=9
---
    public function actionEditBook($id)
    {
        $model = Book::find()->where(['id' => $id])->one();

        if (Yii::$app->request->post()) {

            $model = Book::findOne($id);

            $data = Yii::$app->request->post('Book');
            $formated_data =[
                'book_title' => $data['book_title'],
                'short_description' => $data['short_description'],
                'picture_path' => !empty($data['imageFile']) ? $data['imageFile'] : $model->picture_path,
                'authors_id' => implode(',',$data['authors_id']),
                'publication_date' => $data['publication_date'],
            ];

            $model->load(['Book' =>$formated_data]);

            if (!$model->save()) {

SELECT * FROM `book` WHERE `id`='6'
DELETE FROM `book` WHERE `id`=6
SELECT * FROM `book` WHERE `id`='4'
---
    public function actionDeleteBook($id)
    {
        $model = Book::find()->where(['id' => $id])->one();
        !empty($model) ? $model->delete() : var_dump('Error delete author id='. $id .'!');
        $dataProvider = new ActiveDataProvider([
            'query' => Book::find(),
            'pagination' => [
                'pageSize' => 15,
            ],

        ]);

SELECT * FROM `author` WHERE (`first_name`='Федор') AND (`last_name`='Достоевский')
SELECT * FROM `book`
---
    public function actionFindBookAuthor()
    {
        $data = Yii::$app->request->post();
        $books_id = [];
        $text = explode(' ',$data['text']);
        $model = Author::find()->where(['and' ,['IN','first_name',$text[0]],['IN','last_name',$text[1]]])->asArray()->one();
        $books = Book::find()->asArray()->all();