models/Author.php

SELECT `id`, `first_name`, `last_name` FROM `author`
---
    public static function getAuthors(){
        $author = self::find()->select(['id','first_name','last_name'])->asArray()->all();