models/Book.php

    public function getAuthorName() {
        $tar = $this->authors_id;
        $author = Author::find()->select(['id','first_name','last_name'])->asArray()->all();
---
SELECT `id`, `first_name`, `last_name` FROM `author`